InformationRegisters/КодыТоваровПодключаемогоОборудованияOffline.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КодыТоваровПодключаемогоОборудованияOffline</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПравилоОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АкцизныеМаркиЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>АкцизныеМаркиЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыАкцизныхМарок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АкцизнаяМарка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыАкцизныхМарок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыАкцизныхМарок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВНаличии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРезерве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПостановкеНаБаланс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отсутствует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВНаличииКОтменеПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПостановкеНаБалансКОтменеПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРезервеКОтменеПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЧтенияСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КСписанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОприходованию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ПодключаемоеОборудованиеOfflineЛокализация/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции, используемые в модуле ПодключаемоеОборудованиеOffline
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьВТекстЗапросаИдентификациюАкцизныхМарок(Запрос, ТекстЗапроса, ЗагрузкаАкцизныхМарок, КлючиЕГАИС) Экспорт

	//++ Локализация	
	ОрганизацияЕГАИС = ИнтеграцияЕГАИСУТ.ОрганизацияЕГАИСПоОрганизацииИСкладу(КлючиЕГАИС.Организация, КлючиЕГАИС.Склад);
	ЗагрузкаАкцизныхМарок = ЗначениеЗаполнено(ОрганизацияЕГАИС);
	
	Если ЗагрузкаАкцизныхМарок Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(КодыТоваровПодключаемогоОборудованияOffline.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))                 КАК Номенклатура,
		|	ЕСТЬNULL(КодыТоваровПодключаемогоОборудованияOffline.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
		|	Товары.АкцизнаяМарка                                                                                                               КАК АкцизнаяМарка,
		|	АкцизныеМаркиЕГАИС.Справка2                                                                                                        КАК Справка2,
		|	Товары.ШтрихкодАлкогольнойМарки                                                                                                    КАК ШтрихкодАлкогольнойМарки,
		|	Товары.УникальныйИдентификатор                                                                    	КАК УникальныйИдентификатор,
		|	Товары.НомерСмены                                                                    				КАК НомерСмены
		|ИЗ
		|	ВтТоварыСАкцизнымиМарками КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровПодключаемогоОборудованияOffline КАК КодыТоваровПодключаемогоОборудованияOffline
		|		ПО Товары.Код = КодыТоваровПодключаемогоОборудованияOffline.Код
		|			И КодыТоваровПодключаемогоОборудованияOffline.ПравилоОбмена = &ПравилоОбмена
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АкцизныеМаркиЕГАИС КАК АкцизныеМаркиЕГАИС
		|		ПО Товары.АкцизнаяМарка = АкцизныеМаркиЕГАИС.АкцизнаяМарка
		|			И АкцизныеМаркиЕГАИС.ОрганизацияЕГАИС = &ОрганизацияЕГАИС";
		Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);

	Конецесли;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьАкцизныеМарки(ПараметрыКассовойСмены, ОтчетОРозничныхПродажахОбъект, ТаблицаАкцизныеМарки, ОрганизацияЕГАИС) Экспорт
	
	//++ Локализация
	ОтчетОРозничныхПродажахОбъект.ОрганизацияЕГАИС   = ОрганизацияЕГАИС;
	ОтборПоТаблицеАкцизныхМарок = Новый Структура("НомерСмены,УникальныйИдентификатор", ПараметрыКассовойСмены.НомерСмены, ПараметрыКассовойСмены.УникальныйИдентификатор);
	Для Каждого СтрокаАкциз Из ТаблицаАкцизныеМарки.НайтиСтроки(ОтборПоТаблицеАкцизныхМарок) Цикл
		
		Если ЗначениеЗаполнено(СтрокаАкциз.ШтрихкодАлкогольнойМарки) Тогда
			АкцизнаяМарка = СтрокаАкциз.АкцизнаяМарка;
			
			Если НЕ ЗначениеЗаполнено(АкцизнаяМарка) Тогда
				АкцизнаяМарка = ШтрихкодированиеЕГАИС.СгенерироватьАкцизнуюМарку(
					СтрокаАкциз.ШтрихкодАлкогольнойМарки,
					СтрокаАкциз.Номенклатура,
					СтрокаАкциз.Характеристика);
			КонецЕсли;
			НоваяСтрока = ОтчетОРозничныхПродажахОбъект.АкцизныеМарки.Добавить();
			НоваяСтрока.АкцизнаяМарка = АкцизнаяМарка;
			НоваяСтрока.Справка2 = СтрокаАкциз.Справка2;
			
		КонецЕсли;
		
	КонецЦикла;
	//-- Локализация
	Возврат;
	
КонецПроцедуры

//++ Локализация

// Заполняет статусы акцизных марок
// 
// Параметры:
// 	ДокументОбъект - ДокументОбъект.ОтчетОРозничныхПродажах                 - заполненный документ
// 	ОрганизацияЕГАИС - Булево, СправочникСсылка.КлассификаторОрганизацийЕГАИС - организация для которой загружен отчет
Процедура ЗаполнитьСтатусыПоТабличнойЧастиАкцизныеМарки(ДокументОбъект, ОрганизацияЕГАИС) Экспорт
	
	Если (ОрганизацияЕГАИС = Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.АкцизныеМаркиЕГАИС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОрганизацияЕГАИС.Установить(ОрганизацияЕГАИС);
	
	Для каждого СтрокаАкциз Из ДокументОбъект.АкцизныеМарки Цикл
		
		НаборЗаписей.Отбор.АкцизнаяМарка.Установить(СтрокаАкциз.АкцизнаяМарка);
		
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 1 Тогда
			НаборЗаписей[0].Статус = Перечисления.СтатусыАкцизныхМарок.Реализована;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//-- Локализация

Процедура ЗаписатьОшибкуВЖурналРегистрации(КраткоеПредставлениеОшибки, ПредставлениеОшибки, СтандартнаяОбработка) Экспорт
	
	//++ Локализация
	СтандартнаяОбработка = Ложь;
	ТекстОшибки = НСтр("ru = 'При записи акцизных марок произошла ошибка:
		|%1'");
	ОбщегоНазначения.СообщитьПользователю(
		СтрШаблон(ТекстОшибки, КраткоеПредставлениеОшибки));
	ИнтеграцияЕГАИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(
		СтрШаблон(ТекстОшибки, ПредставлениеОшибки));
	//-- Локализация
	Возврат;
	
КонецПроцедуры
#КонецОбласти
